# -*- coding:utf-8 -*-
import datetime
import scrapy
from scrapy import Request

class Chezhi(scrapy.Spider):
    name = 'chezhi'
    
    def __init__(self,limitPage=None):
        self.updatetime = datetime.datetime.now().strftime('%Y%m%d%H%M%S')
        self.start_urls = [
            'http://www.12365auto.com/zlts/0-0-0-0-0-0_0-0-1.shtml',
        ]
        if limitPage:
            self.limitPage = limitPage
        else:
            self.limitPage = float('inf')
       
    def parse(self, response):
        print('parse:' ,response.url, response.status)
        for tr in response.xpath("//table[@class='ar_c ar_c1']/tr")[1:]:
            datas = {}
            datas['updatetime'] = self.updatetime
            datas['投诉编号'] = ''.join(tr.xpath("./td[1]//text()").extract())
            datas['投诉品牌'] = ''.join(tr.xpath("./td[2]//text()").extract())
            datas['投诉车系'] = ''.join(tr.xpath("./td[3]//text()").extract())
            datas['投诉车型'] = ''.join(tr.xpath("./td[4]//text()").extract())
            datas['投诉简述'] = ''.join(tr.xpath("./td[5]//text()").extract())
            try:
                key = ''.join(tr.xpath("./td[6]//text()").extract())
                dxwt = self._get_dxwt(key) if key else ''
                tmp_dxwt = tr.xpath("./td[3]/@fw").extract()[0].split(',')
                if dxwt:
                    for i in tmp_dxwt:
                        datas['典型问题'] = dxwt if i in dxwt else dxwt+';'+i
                else:
                    datas['典型问题'] = ';'.join(tmp_dxwt)
            except Exception as e:
                self.logger.error(response.url+'\n'+str(e))
                datas['典型问题'] = ''
            datas['投诉时间'] = ''.join(tr.xpath("./td[7]//text()").extract())
            datas['投诉状态'] = ''.join(tr.xpath("./td[8]//text()").extract())
            yield datas
            
        if response.xpath(
            "//a[contains(text(),'下一页')]") and int(
            response.xpath("//span[@class='cur'] /text()"
            ).extract()[0]) < int(self.limitPage):
            yield Request(
                url = response.urljoin(response.xpath("//a[contains(text(),'下一页')]/@href").extract()[0]),
                callback = self.parse
            )
            
    def _get_dxwt(self, key):
        wt_dict = {'D':['转向系统',{112:'助力泵故障',59:'异响',265:'转向机故障',106:'平衡杆故障',80:'抖动',337:'方向盘自由间隙过大',338:'方向盘自由间隙过大',291:'故障灯亮',57:'失灵',154:'方向盘不正',123:'卡滞',156:'打方向沉重',58:'漏油'}],'M':['销售欺诈',{280:'低配当高配卖',315:'变更价格',283:'出售库存车',284:'出售问题车',279:'与宣传不符'}],'H':['车身附件及电器',{192:'天窗开关异常',134:'影音系统故障',263:'发动机启停系统故障',264:'同款不同配置',209:'车身不平整',151:'喇叭故障',268:'车身共振',15:'车身异响',144:'门窗漏风',146:'电瓶故障',147:'汽油箱异响',21:'导航问题',150:'排放系统故障',23:'无发动机防盗',152:'中控台故障',201:'车身有色差',155:'车载互联故障',157:'部件异常磨损',30:'排气管锈蚀',31:'排气管异响',176:'仪表台开裂',289:'倒车雷达失灵',164:'车内异响',40:'车辆自燃',169:'座椅故障',170:'行车安全辅助系统故障',203:'胎压监测故障',48:'密封条损坏',49:'车身模块故障',50:'油箱锁故障',179:'车身装饰脱落',335:'中控台凹陷',54:'三元催化器故障',55:'气囊未弹开',185:'车内异味',168:'部件开裂',60:'雨刮器故障',266:'管路老化',64:'车灯模块故障',67:'车窗升降故障',68:'后备箱故障',197:'中控锁故障',71:'灯组开关故障',72:'门窗异响',73:'发电机故障',202:'仪表故障',75:'汽油箱漏油',78:'汽油泵故障',79:'车身生锈',81:'漆面起泡开裂',82:'车灯不亮',211:'后视镜故障',86:'四驱系统故障',215:'防侧滑功能未启动',88:'车灯进水',89:'天窗异响',90:'天窗漏水',271:'油箱有缺陷',220:'灯罩裂纹或变形',93:'中控台异响',101:'空调问题',195:'自动大灯延迟',103:'气囊故障',104:'行车电脑故障',233:'车门把手故障',234:'传感器故障',109:'车身漏水',110:'电路故障',240:'点火开关故障',113:'玻璃开裂',243:'轮毂问题',244:'没有后防撞钢梁',118:'安全带故障',119:'车钥匙故障',121:'空调异味',253:'定速巡航故障',149:'车门故障'}],'C':['离合器',{16:'打滑',17:'烧毁',267:'离合器失效',181:'沉重',166:'松动',87:'抖动',207:'漏油',65:'异响'}],'E':['制动系统',{99:'漏油',196:'刹车泵故障',231:'刹车鼓爆裂',74:'ABS故障',43:'异响',29:'刹车失灵',269:'刹车偏软',270:'刹车片移位',111:'抖动',239:'刹车盘问题',333:'刹车变硬',250:'无法兰盘',47:'异常磨损',42:'生锈',62:'故障灯亮',159:'手刹故障'}],'B':['变速器',{96:'故障灯亮',33:'异响',98:'低温保护',115:'电脑板故障',69:'拖挡',246:'脱挡',332:'加压泵故障',77:'机械部件故障',334:'无法加速',208:'共振',19:'顿挫',20:'无法换挡',22:'漏油',184:'挡把总成故障',84:'滑阀箱故障',27:'跳挡',95:'抖动'}],'O':['其他原因',{290:'厂家不召回',323:'召回方案不合理',324:'无维修工单',325:'强制购买',326:'服务网点少',327:'其他问题',322:'设计缺陷'}],'A':['发动机',{128:'连杆断裂',129:'曲轴故障',198:'正时皮带断裂',136:'缸体破损',9:'异响',11:'电子油门延迟',12:'漏油',13:'机油乳化',14:'熄火',173:'火花塞故障',336:'缸内有异物',145:'固定螺栓断裂',18:'爆震',163:'功率不足',251:'气门故障',85:'油耗高',329:'拉缸',24:'抖动',91:'点火线圈故障',221:'水泵故障',222:'皮带断裂',328:'抱瓦',160:'无法提速',34:'故障灯亮',35:'怠速不稳',37:'漏防冻液',38:'噪音大',178:'漏气',235:'发动机壳体破裂',44:'无法启动',45:'正时链条及齿轮故障',174:'油门故障',255:'动力消失',241:'发动机下沉',114:'排气故障',53:'喷油嘴故障',137:'喷气嘴故障',191:'冷却系统故障',247:'缸体生锈',189:'涡轮增压器故障',63:'烧机油'}],'N':['配件争议',{320:'未按时到货',321:'未更换定损配件',316:'使用旧件',317:'配件质量差',318:'无零配件',319:'使用非原厂件'}],'I':['服务态度',{292:'否认质量问题',293:'态度蛮横',294:'厂家不回复',295:'不解决问题',296:'活动不通知',281:'互相推诿',282:'故意拖延',297:'不予索赔'}],'J':['人员技术',{304:'粗心大意',305:'未经同意维修',306:'过度维修',298:'多次返修',299:'操作不规范',300:'修出新问题',301:'查不出原因',302:'无专用工具',303:'维修技术差'}],'K':['服务收费',{307:'变相收费',308:'价格不透明'}],'F':['轮胎',{257:'其他问题',130:'爆胎',100:'开裂',186:'起皮',39:'鼓包',41:'胎压偏低',10:'磨损',92:'凹陷',138:'胎面变形',142:'胎面变色'}],'L':['承诺不兑现',{309:'定（订）金纠纷',310:'不履行三包',311:'未按时交付',312:'提不到车',313:'销售承诺不兑现',314:'服务承诺不兑现'}],'G':['前后桥及悬挂系统',{245:'吃胎偏磨',132:'车轮脱落',261:'后轴纵臂断裂隐患',225:'四轮定位偏差',200:'轮毂螺丝断裂',204:'悬挂故障',124:'差速器漏油',210:'下摆臂故障',83:'后桥塌陷',252:'平衡杆异响',25:'减震器漏油',158:'前后桥异响',161:'球笼套漏油',162:'行驶中颠簸',227:'半轴脱落',230:'前后桥断裂',105:'压力轴承故障',171:'减震器过硬',51:'半轴渗油',180:'减震器生锈',117:'跑偏',56:'底盘异响',52:'减震器异响',188:'车轮松动',125:'车轮异响',127:'差速器异响'}]}
        result_list = []
        for wt in key[:-1].split(','):
            r = wt_dict[wt[0]][0] + wt_dict[wt[0]][1].get(int(wt[1:]),'')
            result_list.append(r)
        return ';'.join(result_list)
            